{
    "en": {
        "title_portfolio_heading": "Welcome to my <span class='animated-word'>visual</span> universe",
        "header_slogan": "A visual journey through my ideas and dreams",
        "title_news": "NEW",
        "storytelling_descripcion": "Tales That Spark Imaginations — Stories That Inspire Young Readers\n\nDiscover a collection of animated tales that come to life and encourage kids to love reading.\nIn this trailer you’ll see captivating excerpts from *Little Lettuce* and *Espuma and Negrito* — two colorful stories filled with movement, music, and magic that have already engaged real classrooms.\n\n🎥 What’s inside?\n✨ Animations crafted from original artwork and illustrations\n✨ Dynamic scenes that hold children’s attention\n✨ Playful transitions set to a magical soundtrack\n✨ A sneak peek at future stories to come\n\nThis project is part of an educational series designed to make reading fun, interactive, and unforgettable.\n\n💛 Share the magic of stories with your students or kids, and help them discover the joy of reading!",
        "title_animations": "ANIMATED GIFS",
        "title_concept": "ART CONCEPT",
        "title_sites": "WEBSITES",
        "title_branding": "BRANDING",
        "title_film": "FILM",
        "title_music": "MUSIC",
        "title_aboutMe": "ABOUT ME",
        "title_contact": "CONTACT",
        "title_shop": "SHOP",
        "shop_alert_closed": "The store is not open now",
        "title_portfolio": "PORTFOLIO",
        "title_aboutMe_text": "I’m a multidisciplinary visual artist with a deep passion for animation, digital storytelling, and creative web design. From character animation to motion graphics and HTML/CSS websites, I blend technical skill with artistic sensitivity to bring ideas to life. I have experience working across several creative fields — from 2D short films and web content to branding and audio-visual production. I enjoy styles that feel raw, honest, almost childlike — where hand-drawn textures, cutout animation, and imperfections bring charm and emotion to every frame. Tools I work with daily include Adobe Photoshop, Illustrator, After Effects, Premiere Pro, and HTML/CSS. I’ve also collaborated on sound editing, storytelling, and graphic design pieces for various projects. My current focus is on building a career that bridges visual expression and storytelling, particularly inspired by the Scandinavian animation scene. Always open to new creative collaborations — feel free to reach out or explore some of my work below.",
        "title_socials": "SOCIALS",
        "title_welcome": "WELCOME TO MY WEBSITE",
        "title_welcome_intro": "I'm Wyatt, Frehlic also me. Here you will find the documents that I have created during my studies and the jobs and projects I have carried out throughout my professional career.",
        "title_welcome_link": "<lord-icon src='https://cdn.lordicon.com/ixufqqwf.json' trigger='loop' delay='2000' style='transform: scaleX(-1);'></lord-icon> → click to see my work: ← <lord-icon src='https://cdn.lordicon.com/ixufqqwf.json' trigger='loop' delay='2000'></lord-icon>",
        "Theme_Personalised": "Personalised",
        "Theme_text": "Click for activate the theme <3",
        "title_slide_thisWebsite": "THIS WEBSITE",
        "description_slide_trefahso": "(online shop) html - css - javascript",
        "description_slide_solaris": "(online shop) Wordpress",
        "description_slide_dreamwall": "html - css - firebase. Interactive messaging experience designed to connect people through their words and dreams",
        "title_slide_notepad": "ONLINE NOTEPAD",
        "description_slide_lunstrar": "(web course) Wordpress",
        "branding_description_brand": "online shop - brand design",
        "personal_project": "Personal Project",
        "Sketchbook": "Sketchbook",
        "Concept_Art": "Concept Art",
        "Game": "Game"
    },
    "es": {
        "title_portfolio_heading": "Bienvenido a mi universo <span class='animated-word'>visual</span>",
        "header_slogan": "Un viaje visual a través de mis ideas y sueños",
        "title_news": "NUEVO",
        "storytelling_descripcion": "Relatos que encienden la imaginación — Historias que inspiran a los jóvenes lectores\n\nDescubre una colección de cuentos animados que cobran vida y animan a los niños a amar la lectura.\nEn este tráiler verás fragmentos cautivadores de *Little Lettuce* y *Espuma y Negrito* — dos historias coloridas llenas de movimiento, música y magia que ya han cautivado a aulas reales.\n\n🎥 ¿Qué incluye?\n✨ Animaciones creadas a partir de ilustraciones y material original\n✨ Escenas dinámicas que captan la atención de los niños\n✨ Transiciones divertidas que acompañan una banda sonora mágica\n✨ Un adelanto de futuras historias por venir\n\nEste proyecto forma parte de una serie educativa diseñada para que la lectura sea divertida, interactiva e inolvidable.\n\n💛 ¡Comparte la magia de los cuentos con tus estudiantes o hijos y ayúdales a descubrir la alegría de leer!",
        "title_animations": "GIFS ANIMADOS",
        "title_concept": "CONCEPTO ARTÍSTICO",
        "title_sites": "SITIOS WEB",
        "title_branding": "IDENTIDAD DE MARCA",
        "title_film": "CINE",
        "title_music": "MÚSICA",
        "title_aboutMe": "SOBRE MÍ",
        "title_contact": "CONTACTO",
        "title_shop": "TIENDA",
        "shop_alert_closed": "La tienda no está abierta ahora",
        "title_portfolio": "PORTAFOLIO",
        "title_aboutMe_text": "Soy un artista visual multidisciplinar con una profunda pasión por la animación, la narración digital y el diseño web creativo. Desde la animación de personajes hasta los motion graphics y los sitios web en HTML/CSS, combino habilidades técnicas con sensibilidad artística para dar vida a las ideas. Tengo experiencia en varios campos creativos: desde cortometrajes en 2D y contenido web hasta branding y producción audiovisual. Disfruto de los estilos que se sienten crudos, honestos, casi infantiles, donde las texturas dibujadas a mano, la animación recortada y las imperfecciones aportan encanto y emoción a cada cuadro. Trabajo a diario con herramientas como Adobe Photoshop, Illustrator, After Effects, Premiere Pro y HTML/CSS. También he colaborado en la edición de sonido, narrativas visuales y piezas de diseño gráfico para distintos proyectos. Actualmente, me enfoco en construir una carrera que combine la expresión visual con la narración, especialmente inspirada en la escena de animación escandinava. Siempre abierta a nuevas colaboraciones creativas — no dudes en contactarme o explorar algunos de mis trabajos a continuación.",
        "title_socials": "REDES",
        "title_welcome": "BIENVENIDO A MI WEB",
        "title_welcome_intro": "Soy Wyatt, o Frehlic. aquí encontrarás los trabajos y proyectos que he realizado a lo largo de mi carrera profesional.",
        "title_welcome_link": "<lord-icon src='https://cdn.lordicon.com/ixufqqwf.json' trigger='loop' delay='2000' style='transform: scaleX(-1);'></lord-icon> haz clic para ver mi trabajo: <lord-icon src='https://cdn.lordicon.com/ixufqqwf.json' trigger='loop' delay='2000'></lord-icon>",
        "Theme_Personalised": "Personalizado",
        "Theme_text": "Haz clic para activar un tema <3",
         "title_slide_thisWebsite": "ESTA WEB",
        "description_slide_trefahso": "(tienda online) html - css - javascript",
        "description_slide_solaris": "(tienda online) Wordpress",
        "description_slide_dreamwall": "HTML - CSS - Firebase. Experiencia de mensajería interactiva diseñada para conectar a las personas a través de sus palabras y sueños",
        "title_slide_notepad": "BLOC DE NOTAS EN LINEA",
        "description_slide_lunstrar": "(curso web) Wordpress",
        "branding_description_brand": "tienda en linea - diseño de marca",
        "personal_project": "Proyecto Personal",
        "Sketchbook": "Bocetos",
        "Concept_Art": "Arte conceptual",
        "Game": "Juego"
    },
    "sv": {
        "title_portfolio_heading": "Välkommen till mitt <span class='animated-word'>visuella</span> universum",
        "header_slogan": "En visuell resa genom mina idéer och drömmar",
        "title_news": "NY",
        "storytelling_descripcion": "Sagor som tänder fantasin — Berättelser som inspirerar unga läsare\n\nUpptäck en samling animerade sagor som får liv och uppmuntrar barn att älska läsning.\nI denna trailer får du se fängslande utdrag från *Little Lettuce* och *Espuma och Negrito* — två färgglada berättelser fyllda med rörelse, musik och magi som redan har engagerat riktiga klassrum.\n\n🎥 Vad finns med?\n✨ Animationer skapade från originalillustrationer\n✨ Dynamiska scener som fångar barnens uppmärksamhet\n✨ Lekfulla övergångar till ett magiskt soundtrack\n✨ En förhandsvisning av kommande berättelser\n\nDetta projekt är en del av en utbildningsserie utformad för att göra läsning rolig, interaktiv och oförglömlig.\n\n💛 Dela sagornas magi med dina elever eller barn och hjälp dem att upptäcka glädjen i att läsa!",
        "title_animations": "ANIMERADE GIFAR",
        "title_concept": "KONSTKONCEPT",
        "title_sites": "WEBBPLATSER",
        "title_branding": "VARUMÄRKE",
        "title_film": "FILMER",
        "title_music": "MUSIK",
        "title_aboutMe": "OM MIG",
        "title_contact": "KONTAKT",
        "title_shop": "BUTIK",
        "shop_alert_closed": "Butiken är inte öppen just nu",
        "title_portfolio": "PORTFÖLJ",
        "title_aboutMe_text": "Jag är en multidisciplinär visuell konstnär med en djup passion för animation, digitalt berättande och kreativ webbdesign. Från karaktärsanimation till rörlig grafik och HTML/CSS-webbplatser blandar jag teknisk skicklighet med konstnärlig känslighet för att väcka idéer till liv. Jag har erfarenhet av flera kreativa områden — från 2D-kortfilmer och webbinnehåll till varumärkesdesign och audiovisuell produktion. Jag gillar stilar som känns råa, ärliga, nästan barnsliga — där handritade texturer, cutout-animation och små brister ger charm och känsla åt varje bildruta. Verktyg jag använder dagligen inkluderar Adobe Photoshop, Illustrator, After Effects, Premiere Pro och HTML/CSS. Jag har även samarbetat i ljudredigering, berättande och grafiska designprojekt för olika uppdrag. Just nu fokuserar jag på att bygga en karriär som förenar visuell uttrycksförmåga och berättande, särskilt inspirerad av den skandinaviska animationsscenen. Jag är alltid öppen för nya kreativa samarbeten — tveka inte att höra av dig eller utforska några av mina verk nedan.",
        "title_socials": "NÄTVERK",
        "title_welcome": "VÄLKOMMEN TILL MIN WEBBPLATS",
        "title_welcome_intro": "Jag heter Wyatt och Frehlic är också jag. Här hittar du dokumenten som jag har skapat under mina studier och de jobb och projekt jag har genomfört under min yrkeskarriär.",
        "title_welcome_link": "<lord-icon src='https://cdn.lordicon.com/ixufqqwf.json' trigger='loop' delay='2000' style='transform: scaleX(-1);'></lord-icon> klicka för att se mitt arbete: <lord-icon src='https://cdn.lordicon.com/ixufqqwf.json' trigger='loop' delay='2000'></lord-icon>",
        "Theme_Personalised": "Beställnings",
        "Theme_text": "Klicka för att aktivera temat <3",
        "title_slide_thisWebsite": "DENNA WEBB",
        "description_slide_trefahso": "(butik) html - css - javascript",
        "description_slide_solaris": "(butik) Wordpress",
        "description_slide_dreamwall": "HTML - CSS - Firebase. Interaktiv meddelandeupplevelse utformad för att förena människor genom deras ord och drömmar",
        "title_slide_notepad": "ANTECKNINGS - BLOCK ONLINE",
        "description_slide_lunstrar": "(webbkurs) Wordpress",
        "branding_description_brand": "butik - varumärkesdesign",
        "personal_project": "Personligt projekt",
        "Sketchbook": "Skissbok",
        "Concept_Art": "Konceptkonst",
        "Game": "Spel"
}
}

